# Regiment

### Introduction:

Special thanks to: http://chrisalbon.com/ for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [9]:
import pandas as pd

### Step 2. Create the DataFrame with the following values:

In [10]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

### Step 3. Assign it to a variable called regiment.
#### Don't forget to name each column

In [11]:
regiment=pd.DataFrame(data=raw_data)
regiment

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

### Step 4. What is the mean preTestScore from the regiment Nighthawks?

In [29]:
for i in regiment.regiment:
    if (i=='Nighthawks'):
        print(" the mean " +str(regiment['preTestScore'].mean()))

 the mean 11.083333333333334
 the mean 11.083333333333334
 the mean 11.083333333333334
 the mean 11.083333333333334

### Step 5. Present general statistics by company

In [13]:
regiment.company.describe()

count      12
unique      2
top       1st
freq        6
Name: company, dtype: object

In [14]:
regiment.company.info()

<class 'pandas.core.series.Series'>
RangeIndex: 12 entries, 0 to 11
Series name: company
Non-Null Count  Dtype
--------------  -----
12 non-null     object
dtypes: object(1)
memory usage: 224.0+ bytes

### Step 6. What is the mean of each company's preTestScore?

In [38]:
for i in regiment.company.unique() :
    print("the company "+ regiment['company']+" the mean is " +str(regiment['preTestScore'].mean()))

0     the company 1st the mean is 11.083333333333334
1     the company 1st the mean is 11.083333333333334
2     the company 2nd the mean is 11.083333333333334
3     the company 2nd the mean is 11.083333333333334
4     the company 1st the mean is 11.083333333333334
5     the company 1st the mean is 11.083333333333334
6     the company 2nd the mean is 11.083333333333334
7     the company 2nd the mean is 11.083333333333334
8     the company 1st the mean is 11.083333333333334
9     the company 1st the mean is 11.083333333333334
10    the company 2nd the mean is 11.083333333333334
11    the company 2nd the mean is 11.083333333333334
Name: company, dtype: object
0     the company 1st the mean is 11.083333333333334
1     the company 1st the mean is 11.083333333333334
2     the company 2nd the mean is 11.083333333333334
3     the company 2nd the mean is 11.083333333333334
4     the company 1st the mean is 11.083333333333334
5     the company 1st the mean is 11.083333333333334
6     the company 2nd the mean is 11.083333333333334
7     the company 2nd the mean is 11.083333333333334
8     the company 1st the mean is 11.083333333333334
9     the company 1st the mean is 11.083333333333334
10    the company 2nd the mean is 11.083333333333334
11    the company 2nd the mean is 11.083333333333334
Name: company, dtype: object

### Step 7. Present the mean preTestScores grouped by regiment and company

In [45]:
regiment.pivot_table(index="regiment",columns="company", aggfunc=np.average)

C:\Users\hp\AppData\Local\Temp\ipykernel_4572\3298823972.py:1: FutureWarning: Dropping invalid columns in DataFrameGroupBy.agg is deprecated. In a future version, a TypeError will be raised. Before calling .agg, select only columns which should be valid for the function.
  regiment.pivot_table(index="regiment",columns="company", aggfunc=np.average)

           postTestScore       preTestScore
company              1st   2nd          1st   2nd
regiment
Dragoons            47.5  75.5          3.5  27.5
Nighthawks          59.5  59.5         14.0  16.5
Scouts              66.0  66.0          2.5   2.5

### Step 8. Present the mean preTestScores grouped by regiment and company without heirarchical indexing

In [48]:
regiment.pivot_table(index="regiment",columns="company",values="preTestScore" ,aggfunc=np.average)

company      1st   2nd
regiment
Dragoons     3.5  27.5
Nighthawks  14.0  16.5
Scouts       2.5   2.5

### Step 9. Group the entire dataframe by regiment and company

In [51]:
x=regiment.groupby(["regiment","company"])
x

### Step 10. What is the number of observations in each regiment and company

In [39]:
len(regiment.regiment)

12

In [40]:
len(regiment.company)

12

In [41]:
regiment.regiment.describe()

count             12
unique             3
top       Nighthawks
freq               4
Name: regiment, dtype: object

In [42]:
regiment.company.describe()

count      12
unique      2
top       1st
freq        6
Name: company, dtype: object

In [43]:
regiment.regiment.shape

(12,)

In [44]:
regiment.company.shape

(12,)

### Step 11. Iterate over a group and print the name and the whole data from the regiment

In [55]:
for regiment, data in x:
    print("regiment:",regiment)
    
    print("data:",data)
    print("\n")

regiment: ('Dragoons', '1st')
data:    regiment company   name  preTestScore  postTestScore
4  Dragoons     1st  Cooze             3             70
5  Dragoons     1st  Jacon             4             25


regiment: ('Dragoons', '2nd')
data:    regiment company    name  preTestScore  postTestScore
6  Dragoons     2nd  Ryaner            24             94
7  Dragoons     2nd    Sone            31             57


regiment: ('Nighthawks', '1st')
data:      regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94


regiment: ('Nighthawks', '2nd')
data:      regiment company    name  preTestScore  postTestScore
2  Nighthawks     2nd     Ali            31             57
3  Nighthawks     2nd  Milner             2             62


regiment: ('Scouts', '1st')
data:   regiment company   name  preTestScore  postTestScore
8   Scouts     1st  Sloan             2             62
9   Scouts     1st  Piger             3             70


regiment: ('Scouts', '2nd')
data:    regiment company   name  preTestScore  postTestScore
10   Scouts     2nd  Riani             2             62
11   Scouts     2nd    Ali             3             70

In [56]:
for company, data in x:
    print("regiment:",company)
    
    print("data:",data)
    print("\n")

regiment: ('Dragoons', '1st')
data:    regiment company   name  preTestScore  postTestScore
4  Dragoons     1st  Cooze             3             70
5  Dragoons     1st  Jacon             4             25


regiment: ('Dragoons', '2nd')
data:    regiment company    name  preTestScore  postTestScore
6  Dragoons     2nd  Ryaner            24             94
7  Dragoons     2nd    Sone            31             57


regiment: ('Nighthawks', '1st')
data:      regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94


regiment: ('Nighthawks', '2nd')
data:      regiment company    name  preTestScore  postTestScore
2  Nighthawks     2nd     Ali            31             57
3  Nighthawks     2nd  Milner             2             62


regiment: ('Scouts', '1st')
data:   regiment company   name  preTestScore  postTestScore
8   Scouts     1st  Sloan             2             62
9   Scouts     1st  Piger             3             70


regiment: ('Scouts', '2nd')
data:    regiment company   name  preTestScore  postTestScore
10   Scouts     2nd  Riani             2             62
11   Scouts     2nd    Ali             3             70